Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
          if ((imap->_uidSearch && strcmp(buf.c_str(), pgm2Str(esp_mail_str_140)) == 0) || (imap->_unseen && buf.find(pgm2Str(esp_mail_str_224)) != MB_String::npos))
            buf.clear();

          if (strcmp(buf.c_str(), pgm2Str(esp_mail_str_141)) != 0 && buf.length() > 0)
          {
            command.appendP(esp_mail_str_131);
            command += buf;
          }
         
          buf.clear();
        }
      }

      if (imap->_unseen && strpos(imap->_config->search.criteria.c_str(), pgm2Str(esp_mail_str_223), 0) == -1)
        command.appendP(esp_mail_str_223);

      if (buf.length() > 0)
      {
        command.appendP(esp_mail_str_131);
        command += buf;
      }

      if (imapSend(imap, command.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      command.clear();

      imap->_imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_search;

      if (!handleIMAPResponse(imap, IMAP_STATUS_BAD_COMMAND, closeSession))
        return false;

      if (imap->_readCallback)
      {
        MB_String s;
        s.appendP(esp_mail_str_34);
        s.appendP(esp_mail_str_68);
        s += imap->_config->limit.search;
        imapCB(imap, s.c_str(), false);

        if (imap->_msgUID.size() > 0)
        {

          s.appendP(esp_mail_str_69, true);
          s += imap->_mbif._searchCount;
          s.appendP(esp_mail_str_70);
          imapCB(imap, s.c_str(), false);

          s.appendP(esp_mail_str_71, true);
          s += imap->_msgUID.size();
          s.appendP(esp_mail_str_70);
          imapCB(imap, s.c_str(), false);
        }
        else
          imapCBP(imap, esp_mail_str_72, false);
      }
    }
    else
    {
      if (imap->_readCallback)
        imapCBP(imap, esp_mail_str_73, false);

      imap->_mbif._availableItems++;
      int uid = imap->getUID(imap->_mbif._msgCount);
      imap->_msgUID.push_back(uid);
      imap->_headerOnly = false;
      _uid = uid;
      imap->_config->fetch.uid = _uid;
    }
  }
  else
  {
    imap->_mbif._availableItems++;
    imap->_msgUID.push_back(atoi(imap->_config->fetch.uid.c_str()));
  }

  for (size_t i = 0; i < imap->_msgUID.size(); i++)
  {
    imap->_cMsgIdx = i;
    imap->_totalRead++;

    if (MailClient.getFreeHeap() - (imap->_config->limit.msg_size * (i + 1)) < ESP_MAIL_MIN_MEM)
    {
      if (imap->_debug)
        errorStatusCB(imap, MAIL_CLIENT_ERROR_OUT_OF_MEMORY);
      goto out;
    }

    if (imap->_readCallback)
    {
      readCount++;

      MB_String s;
      s.appendP(esp_mail_str_74);
      s += imap->_totalRead;

      if (imap->_uidSearch || imap->_config->fetch.uid.length() > 0)
        s.appendP(esp_mail_str_75);
      else
        s.appendP(esp_mail_str_76);

      s += imap->_msgUID[i];
      imapCB(imap, "", false);
      imapCB(imap, s.c_str(), false);
    }

    if (imap->_debug)
      debugInfoP(esp_mail_str_233);

    MB_String cmd;
    if (imap->_uidSearch || imap->_config->fetch.uid.length() > 0)
      cmd.appendP(esp_mail_str_142);
    else
      cmd.appendP(esp_mail_str_143);

    if (imap->_debug)
      debugInfoP(esp_mail_str_77);

    cmd += imap->_msgUID[i];

    cmd.appendP(esp_mail_str_147);
    if (!imap->_config->fetch.set_seen)
    {
      cmd.appendP(esp_mail_str_152);
      cmd.appendP(esp_mail_str_214);
    }
    cmd.appendP(esp_mail_str_218);

    cmd.appendP(esp_mail_str_144);
    cmd.appendP(esp_mail_str_219);
    if (imapSend(imap, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    imap->_imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_fetch_body_header;

    int err = IMAP_STATUS_BAD_COMMAND;
    if (imap->_headerOnly)
      err = IMAP_STATUS_IMAP_RESPONSE_FAILED;

    if (!handleIMAPResponse(imap, err, closeSession))
      return false;

    cHeader(imap)->flags = imap->getFlags(cHeader(imap)->message_no);

    if (!imap->_headerOnly)
    {
      imap->_cPartIdx = 0;

      //multipart
      if (cHeader(imap)->multipart)
      {
        struct esp_mail_imap_multipart_level_t mlevel;
        mlevel.level = 1;
        mlevel.fetch_rfc822_header = false;
        mlevel.append_body_text = false;
        imap->_multipart_levels.push_back(mlevel);

        if (!fetchMultipartBodyHeader(imap, i))
          return false;
      }
      else
      {
        //singlepart
        if (imap->_debug)
        {
          MB_String s;
          s.appendP(esp_mail_str_81);
          s += '1';
          esp_mail_debug(s.c_str());
        }

        cHeader(imap)->partNumStr.clear();
        if (!sendIMAPCommand(imap, i, 1))
          return false;

        imap->_imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_fetch_body_mime;
        if (!handleIMAPResponse(imap, IMAP_STATUS_BAD_COMMAND, closeSession))
          return false;
      }

      if (imap->_config->download.text || imap->_config->download.html || imap->_config->download.attachment || imap->_config->download.inlineImg)
      {
        if (!_sdOk && imap->_config->storage.type == esp_mail_file_storage_type_sd)
        {
#if defined(ESP_MAIL_SD_FS)
          _sdOk = sdTest();
          if (_sdOk)
          {
            if (imap->_config->storage.saved_path.length() == 0)
              imap->_config->storage.saved_path = FLASH_STR_MCR("/");
            else if (!ESP_MAIL_SD_FS.exists(imap->_config->storage.saved_path.c_str()))
              createDirs(imap->_config->storage.saved_path);
          }

#endif
        }
        else if (!_flashOk && imap->_config->storage.type == esp_mail_file_storage_type_flash)
        {
#if defined(ESP_MAIL_FLASH_FS)
#if defined(ESP32)
          _flashOk = ESP_MAIL_FLASH_FS.begin(FORMAT_FLASH);
#elif defined(ESP8266)
          _flashOk = ESP_MAIL_FLASH_FS.begin();
#endif
#endif
        }
      }

      if (cHeader(imap)->part_headers.size() > 0)
      {

         if (cHeader(imap)->attachment_count > 0)
           cHeader(imap)->hasAttachment = true;

        if (cHeader(imap)->attachment_count > 0 && imap->_readCallback)
        {
          MB_String s;
          s.appendP(esp_mail_str_34);
          s.appendP(esp_mail_str_78);
          s += cHeader(imap)->attachment_count;
          s.appendP(esp_mail_str_79);
          imapCB(imap, s.c_str(), false);

          for (size_t j = 0; j < cHeader(imap)->part_headers.size(); j++)
          {
            imap->_cPartIdx = j;
            if (!cPart(imap)->rfc822_part && cPart(imap)->attach_type != esp_mail_att_type_none)
              imapCB(imap, cPart(imap)->filename.c_str(), false);
          }
        }

        MB_String s1, s2;
        int _idx1 = 0;
        for (size_t j = 0; j < cHeader(imap)->part_headers.size(); j++)
        {
          imap->_cPartIdx = j;
          if (cPart(imap)->rfc822_part)
          {
            s1 = cPart(imap)->partNumStr;
            _idx1 = cPart(imap)->rfc822_msg_Idx;
          }
          else if (s1.length() > 0)
          {
            if (multipartMember(s1, cPart(imap)->partNumStr))
            {
              cPart(imap)->message_sub_type = esp_mail_imap_message_sub_type_rfc822;
              cPart(imap)->rfc822_msg_Idx = _idx1;
            }
          }

          if (cPart(imap)->multipart_sub_type == esp_mail_imap_multipart_sub_type_parallel)
            s2 = cPart(imap)->partNumStr;
          else if (s2.length() > 0)
          {
            if (multipartMember(s2, cPart(imap)->partNumStr))
            {
              cPart(imap)->attach_type = esp_mail_att_type_attachment;
              if (cPart(imap)->filename.length() == 0)
              {
                if (cPart(imap)->name.length() > 0)
                  cPart(imap)->filename = cPart(imap)->name;
                else
                {
                  cPart(imap)->filename = getRandomUID();
                  cPart(imap)->filename.appendP(esp_mail_str_40);
                }
              }
            }
          }
        }

