Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
  return true;
}
bool ESP_Mail_Client::getMultipartFechCmd(IMAPSession *imap, int msgIdx, MB_String &partText)
{
  if (imap->_multipart_levels.size() == 0)
    return false;

  int cLevel = imap->_multipart_levels.size() - 1;

  cHeader(imap)->partNumStr.clear();

  if (imap->_uidSearch || imap->_config->fetch.uid.length() > 0)
    partText.appendP(esp_mail_str_142, true);
  else
    partText.appendP(esp_mail_str_143, true);

  partText += imap->_msgUID[msgIdx];

  partText.appendP(esp_mail_str_147);
  if (!imap->_config->fetch.set_seen)
  {
    partText.appendP(esp_mail_str_152);
    partText.appendP(esp_mail_str_214);
  }
  partText.appendP(esp_mail_str_218);

  for (size_t i = 0; i < imap->_multipart_levels.size(); i++)
  {
    if (i > 0)
    {
      partText.appendP(esp_mail_str_152);
      cHeader(imap)->partNumStr.appendP(esp_mail_str_152);
    }

    partText += imap->_multipart_levels[i].level;
    cHeader(imap)->partNumStr += imap->_multipart_levels[i].level;
  }

  if (imap->_multipart_levels[cLevel].fetch_rfc822_header)
  {
    partText.appendP(esp_mail_str_152);
    partText.appendP(esp_mail_str_144);
    partText.appendP(esp_mail_str_219);
    imap->_multipart_levels[cLevel].append_body_text = true;
  }
  else
    partText.appendP(esp_mail_str_148);

  imap->_multipart_levels[cLevel].fetch_rfc822_header = false;

  return true;
}

bool ESP_Mail_Client::multipartMember(const MB_String &part, const MB_String &check)
{
  if (part.length() > check.length())
    return false;

  for (size_t i = 0; i < part.length(); i++)
    if (part[i] != check[i])
      return false;

  return true;
}

bool ESP_Mail_Client::fetchMultipartBodyHeader(IMAPSession *imap, int msgIdx)
{
  bool ret = true;

  if (!connected(imap))
  {
    closeTCPSession(imap);
    return false;
  }
  int cLevel = 0;

  do
  {

    struct esp_mail_message_part_info_t *_cpart = &cHeader(imap)->part_headers[cHeader(imap)->message_data_count - 1];
    bool rfc822_body_subtype = _cpart->message_sub_type == esp_mail_imap_message_sub_type_rfc822;

    MB_String cmd;

    if (!getMultipartFechCmd(imap, msgIdx, cmd))
      return true;

    if (imap->_debug)
    {
      MB_String s;
      if (imap->_multipart_levels.size() > 1)
        s.appendP(esp_mail_str_86);
      else
        s.appendP(esp_mail_str_81);
      s += cHeader(imap)->partNumStr;
      esp_mail_debug(s.c_str());
    }

    if (imapSend(imap, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    imap->_imap_cmd = esp_mail_imap_cmd_fetch_body_mime;

    ret = handleIMAPResponse(imap, IMAP_STATUS_IMAP_RESPONSE_FAILED, false);

    _cpart = &cHeader(imap)->part_headers[cHeader(imap)->message_data_count - 1];
    rfc822_body_subtype = _cpart->message_sub_type == esp_mail_imap_message_sub_type_rfc822;
    cLevel = imap->_multipart_levels.size() - 1;

    if (ret)
    {

      if (_cpart->multipart)
      {
        if (_cpart->multipart_sub_type == esp_mail_imap_multipart_sub_type_parallel || _cpart->multipart_sub_type == esp_mail_imap_multipart_sub_type_alternative || _cpart->multipart_sub_type == esp_mail_imap_multipart_sub_type_related || _cpart->multipart_sub_type == esp_mail_imap_multipart_sub_type_mixed)
        {
          struct esp_mail_imap_multipart_level_t mlevel;
          mlevel.level = 1;
          mlevel.fetch_rfc822_header = false;
          mlevel.append_body_text = false;
          imap->_multipart_levels.push_back(mlevel);
          fetchMultipartBodyHeader(imap, msgIdx);
        }
        else
          imap->_multipart_levels[cLevel].level++;
      }
      else
      {
        if (rfc822_body_subtype)
        {
          //to get additional rfc822 message header
          imap->_multipart_levels[cLevel].fetch_rfc822_header = true;
          fetchMultipartBodyHeader(imap, msgIdx);
        }
        else
        {
          if (imap->_multipart_levels[cLevel].append_body_text)
          {
            //single part rfc822 message body, append TEXT to the body fetch command
            _cpart->partNumFetchStr.appendP(esp_mail_str_152);
            _cpart->partNumFetchStr.appendP(esp_mail_str_215);
            imap->_multipart_levels[cLevel].append_body_text = false;
          }
          imap->_multipart_levels[cLevel].level++;
        }
      }
    }

  } while (ret);

  imap->_multipart_levels.pop_back();

  if (imap->_multipart_levels.size() > 0)
  {
    cLevel = imap->_multipart_levels.size() - 1;
    imap->_multipart_levels[cLevel].level++;
  }

  return true;
}

bool ESP_Mail_Client::connected(IMAPSession *imap)
{
  if (!imap->tcpClient.stream())
    return false;
  return imap->tcpClient.stream()->connected();
}

bool ESP_Mail_Client::imapAuth(IMAPSession *imap)
{

  bool ssl = false;
  MB_String buf;
#if defined(ESP32)
  imap->tcpClient.setDebugCallback(NULL);
#elif defined(ESP8266)

#endif

  if (imap->_config != nullptr)
  {
    if (imap->_config->fetch.uid.length() > 0)
      imap->_headerOnly = false;
    else
      imap->_headerOnly = true;
  }

  imap->_totalRead = 0;
  imap->_secure = true;
  bool secureMode = true;

#if defined(ESP32)
  if (imap->_debug)
    imap->tcpClient.setDebugCallback(esp_mail_debug);
#elif defined(ESP8266)
  imap->tcpClient.txBufDivider = 16; //minimum, tx buffer size for ssl data and request command data
  imap->tcpClient.rxBufDivider = 1;
  if (imap->_config != nullptr)
  {
    if (!imap->_headerOnly && !imap->_config->enable.html && !imap->_config->enable.text && !imap->_config->download.attachment && !imap->_config->download.inlineImg && !imap->_config->download.html && !imap->_config->download.text)
      imap->tcpClient.rxBufDivider = 16; // minimum rx buffer size for only message header
  }
#endif

  if (imap->_sesson_cfg->server.port == esp_mail_imap_port_143)
  {
    imap->_secure = false;
    secureMode = false;
  }
  else
    secureMode = !imap->_sesson_cfg->secure.startTLS;
#if defined(ESP32) || defined(ESP8266)
  setSecure(imap->tcpClient, imap->_sesson_cfg, imap->_caCert);
#endif
  if (imap->_readCallback)
    imapCBP(imap, esp_mail_str_50, false);

  if (imap->_debug)
  {
    MB_String s;
    s.appendP(esp_mail_str_314);
    s += ESP_MAIL_VERSION;
#if defined(ARDUINO_ARCH_SAMD) || defined(__AVR_ATmega4809__)
    MB_String ninaFw = WiFi.firmwareVersion();
    s.appendP(esp_mail_str_329);
    s += ninaFw;
    imap->tcpClient.firmwareBuildNumber();
    if (imap->tcpClient._fwBuild > 0)
    {
      s.appendP(esp_mail_str_330);
      s += imap->tcpClient._fwBuild;
    }
#endif
    esp_mail_debug(s.c_str());

    debugInfoP(esp_mail_str_225);
    s.appendP(esp_mail_str_261, true);
    s.appendP(esp_mail_str_211);
    s += imap->_sesson_cfg->server.host_name;
    esp_mail_debug(s.c_str());
    s.appendP(esp_mail_str_261, true);
    s.appendP(esp_mail_str_201);
    s += imap->_sesson_cfg->server.port;
    esp_mail_debug(s.c_str());
  }

  imap->tcpClient.begin(imap->_sesson_cfg->server.host_name.c_str(), imap->_sesson_cfg->server.port);

  ethDNSWorkAround(imap->_sesson_cfg);

  if (!imap->tcpClient.connect(secureMode, imap->_sesson_cfg->certificate.verify))
    return handleIMAPError(imap, IMAP_STATUS_SERVER_CONNECT_FAILED, false);

