Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
      if (cHeader(imap)->header_fields.sender.length() > 0)
      {
        s.appendP(esp_mail_str_150, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.sender.c_str());
      }

      if (cHeader(imap)->header_fields.to.length() > 0)
      {
        s.appendP(esp_mail_str_11, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.to.c_str());
      }

      if (cHeader(imap)->header_fields.cc.length() > 0)
      {
        s.appendP(esp_mail_str_108, true);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.cc.c_str());
      }

      if (cHeader(imap)->header_fields.date.length() > 0)
      {
        s.appendP(esp_mail_str_99, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.date.c_str());
      }

      if (cHeader(imap)->header_fields.subject.length() > 0)
      {
        s.appendP(esp_mail_str_24, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.subject.c_str());
      }

      if (cHeader(imap)->header_fields.reply_to.length() > 0)
      {
        s.appendP(esp_mail_str_184, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.reply_to.c_str());
      }

      if (cHeader(imap)->header_fields.return_path.length() > 0)
      {
        s.appendP(esp_mail_str_46, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.return_path.c_str());
      }

      if (cHeader(imap)->header_fields.in_reply_to.length() > 0)
      {
        s.appendP(esp_mail_str_109, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.in_reply_to.c_str());
      }

      if (cHeader(imap)->header_fields.references.length() > 0)
      {
        s.appendP(esp_mail_str_107, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.references.c_str());
      }

      if (cHeader(imap)->header_fields.comments.length() > 0)
      {
        s.appendP(esp_mail_str_134, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.comments.c_str());
      }

      if (cHeader(imap)->header_fields.keywords.length() > 0)
      {
        s.appendP(esp_mail_str_145, true);
        s.appendP(esp_mail_str_131);
        file.print(s.c_str());
        file.println(cHeader(imap)->header_fields.keywords.c_str());
      }

      if (cHeader(imap)->attachment_count > 0)
      {

        s.appendP(esp_mail_str_113, true);
        file.print(s.c_str());
        file.println(cHeader(imap)->attachment_count);

        for (int j = 0; j < cHeader(imap)->attachment_count; j++)
        {
          if (imap->_headers[cIdx(imap)].part_headers[j].attach_type == esp_mail_att_type_none || imap->_headers[cIdx(imap)].part_headers[j].rfc822_part)
            continue;
          struct esp_mail_attachment_info_t att;
          att.filename = imap->_headers[cIdx(imap)].part_headers[j].filename.c_str();
          att.mime = imap->_headers[cIdx(imap)].part_headers[j].content_type.c_str();
          att.name = imap->_headers[cIdx(imap)].part_headers[j].name.c_str();
          att.size = imap->_headers[cIdx(imap)].part_headers[j].attach_data_size;
          att.creationDate = imap->_headers[cIdx(imap)].part_headers[j].creation_date.c_str();
          att.type = imap->_headers[cIdx(imap)].part_headers[j].attach_type;

          s.appendP(esp_mail_str_114, true);
          file.print(s.c_str());
          file.println(j + 1);

          s.appendP(esp_mail_str_115, true);
          file.print(s.c_str());
          file.println(att.filename);

          s.appendP(esp_mail_str_116, true);
          file.print(s.c_str());
          file.println(att.name);

          s.appendP(esp_mail_str_117, true);
          file.print(s.c_str());
          file.println(att.size);

          s.appendP(esp_mail_str_118, true);
          file.print(s.c_str());
          file.println(att.mime);

          s.appendP(esp_mail_str_119, true);
          file.print(s.c_str());
          file.println(att.creationDate);
        }
      }

      file.close();
    }
    imap->_headerSaved = true;
  }
}

esp_mail_imap_response_status ESP_Mail_Client::imapResponseStatus(IMAPSession *imap, char *response)
{
  imap->_imapStatus.text.clear();
  if (strposP(response, esp_mail_imap_response_1, 0) > -1)
    return esp_mail_imap_response_status::esp_mail_imap_resp_ok;
  else if (strposP(response, esp_mail_imap_response_2, 0) > -1)
  {
    imap->_imapStatus.text = response;
    imap->_imapStatus.text = imap->_imapStatus.text.substr(strlen_P(esp_mail_imap_response_2));
    return esp_mail_imap_response_status::esp_mail_imap_resp_no;
  }
  else if (strposP(response, esp_mail_imap_response_3, 0) > -1)
  {
    imap->_imapStatus.text = response;
    imap->_imapStatus.text = imap->_imapStatus.text.substr(strlen_P(esp_mail_imap_response_3));
    return esp_mail_imap_response_status::esp_mail_imap_resp_bad;
  }
  return esp_mail_imap_response_status::esp_mail_imap_resp_unknown;
}

void ESP_Mail_Client::handleCapability(IMAPSession *imap, char *buf, int &chunkIdx)
{
  if (chunkIdx == 0)
  {
    if (strposP(buf, esp_mail_imap_response_10, 0) > -1)
    {
      if (strposP(buf, esp_mail_imap_response_11, 0) > -1)
        imap->_auth_capability.login = true;
      if (strposP(buf, esp_mail_imap_response_12, 0) > -1)
        imap->_auth_capability.plain = true;
      if (strposP(buf, esp_mail_imap_response_13, 0) > -1)
        imap->_auth_capability.xoauth2 = true;
      if (strposP(buf, esp_mail_imap_response_14, 0) > -1)
        imap->_auth_capability.start_tls = true;
      if (strposP(buf, esp_mail_imap_response_15, 0) > -1)
        imap->_auth_capability.cram_md5 = true;
      if (strposP(buf, esp_mail_imap_response_16, 0) > -1)
        imap->_auth_capability.digest_md5 = true;
      if (strposP(buf, esp_mail_imap_response_17, 0) > -1)
        imap->_read_capability.idle = true;
      if (strposP(buf, esp_mail_imap_response_18, 0) > -1)
        imap->_read_capability.imap4 = true;
      if (strposP(buf, esp_mail_imap_response_19, 0) > -1)
        imap->_read_capability.imap4rev1 = true;
    }
  }
}

void ESP_Mail_Client::handleFolders(IMAPSession *imap, char *buf)
{
  struct esp_mail_folder_info_t fd;
  char *tmp = nullptr;
  int p1 = strposP(buf, esp_mail_imap_response_4, 0);
  int p2 = 0;
  if (p1 != -1)
  {
    p1 = strposP(buf, esp_mail_str_198, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_192, p1 + 1);
      if (p2 != -1)
      {
        tmp = (char *)newP(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.attributes = tmp;
        delP(&tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_136, 0);
    if (p1 != -1)
    {
      p2 = strposP(buf, esp_mail_str_136, p1 + 1);
      if (p2 != -1)
      {
        tmp = (char *)newP(p2 - p1);
        strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
        if (tmp[p2 - p1 - 2] == '\r')
          tmp[p2 - p1 - 2] = 0;
        fd.delimiter = tmp;
        delP(&tmp);
      }
    }

    p1 = strposP(buf, esp_mail_str_131, p2);
    if (p1 != -1)
    {
      p2 = strlen(buf);
      tmp = (char *)newP(p2 - p1);
      if (buf[p1 + 1] == '"')
        p1++;
      strncpy(tmp, buf + p1 + 1, p2 - p1 - 1);
      if (tmp[p2 - p1 - 2] == '\r')
        tmp[p2 - p1 - 2] = 0;
      if (tmp[strlen(tmp) - 1] == '"')
        tmp[strlen(tmp) - 1] = 0;
      fd.name = tmp;
      delP(&tmp);
    }
    imap->_folders.add(fd);
  }
}

bool ESP_Mail_Client::handleIdle(IMAPSession *imap)
{

