Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
  filePath = fpath;
}

IMAPSession::IMAPSession()
{
}
IMAPSession::~IMAPSession()
{
  empty();
#if defined(ESP32) || defined(ESP8266)
  _caCert.reset();
  _caCert = nullptr;
#endif
}

bool IMAPSession::closeSession()
{
  if (!_tcpConnected)
    return false;

  if (_mbif._idleTimeMs > 0)
    mStopListen(false);

#if defined(ESP32)
  /** 
   * The strange behavior in ESP8266 SSL client, BearSSLWiFiClientSecure
   * The client disposed without memory released after the server close 
   * the connection due to LOGOUT command, which caused the memory leaks.
  */
  if (!MailClient.imapLogout(this))
    return false;
#endif
  return MailClient.handleIMAPError(this, 0, true);
}

bool IMAPSession::connect(ESP_Mail_Session *session, IMAP_Config *config)
{
  if (_tcpConnected)
    MailClient.closeTCPSession(this);

  _sesson_cfg = session;
  _config = config;

  if (session)
  {
    if (session->time.ntp_server.length() > 0)
    {
#if defined(ESP_MAIL_DEFAULT_DEBUG_PORT)
      ESP_MAIL_DEFAULT_DEBUG_PORT.println(F("Acquiring time from NTP server...\n"));
#endif
      MailClient.Time.setClock(session->time.gmt_offset, session->time.day_light_offset, session->time.ntp_server.c_str());
      unsigned long waitMs = millis();
      while (!MailClient.Time.clockReady() && millis() - waitMs < 5000)
      {
        delay(0);
      }
      MailClient._clockReady = MailClient.Time.clockReady();
    }
  }

#if defined(ESP32) || defined(ESP8266)

  _caCert = nullptr;

  if (strlen(_sesson_cfg->certificate.cert_data) > 0)
    _caCert = std::shared_ptr<const char>(_sesson_cfg->certificate.cert_data);

  if (strlen(_sesson_cfg->certificate.cert_file) > 0)
  {
    if (_sesson_cfg->certificate.cert_file_storage_type == esp_mail_file_storage_type::esp_mail_file_storage_type_sd && !MailClient._sdOk)
      MailClient._sdOk = MailClient.sdTest();
    if (_sesson_cfg->certificate.cert_file_storage_type == esp_mail_file_storage_type::esp_mail_file_storage_type_flash && !MailClient._flashOk)
    {
#if defined(ESP_MAIL_FLASH_FS)
#if defined(ESP32)
      MailClient._flashOk = ESP_MAIL_FLASH_FS.begin(FORMAT_FLASH);
#elif defined(ESP8266)
      MailClient._flashOk = ESP_MAIL_FLASH_FS.begin();
#endif
#endif
    }
  }

#endif

  return MailClient.imapAuth(this);
}

void IMAPSession::debug(int level)
{
  if (level > esp_mail_debug_level_0)
  {
    if (level > esp_mail_debug_level_3)
      level = esp_mail_debug_level_1;
    _debugLevel = level;
    _debug = true;
  }
  else
  {
    _debugLevel = esp_mail_debug_level_0;
    _debug = false;
  }
}

String IMAPSession::errorReason()
{
  MB_String ret;

  if (_imapStatus.text.length() > 0)
    return _imapStatus.text.c_str();

  switch (_imapStatus.statusCode)
  {
  case IMAP_STATUS_SERVER_CONNECT_FAILED:
    ret.appendP(esp_mail_str_38);
    break;
  case MAIL_CLIENT_ERROR_CONNECTION_CLOSED:
    ret.appendP(esp_mail_str_221);
    break;
  case MAIL_CLIENT_ERROR_READ_TIMEOUT:
    ret.appendP(esp_mail_str_258);
    break;
  case MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED:
    ret.appendP(esp_mail_str_305);
    break;
  case IMAP_STATUS_NO_MESSAGE:
    ret.appendP(esp_mail_str_306);
    break;
  case IMAP_STATUS_ERROR_DOWNLAD_TIMEOUT:
    ret.appendP(esp_mail_str_93);
    break;
  case MAIL_CLIENT_ERROR_SSL_TLS_STRUCTURE_SETUP:
    ret.appendP(esp_mail_str_132);
    break;
  case IMAP_STATUS_CLOSE_MAILBOX_FAILED:
    ret.appendP(esp_mail_str_188);
    break;
  case IMAP_STATUS_OPEN_MAILBOX_FAILED:
    ret.appendP(esp_mail_str_281);
    break;
  case IMAP_STATUS_LIST_MAILBOXS_FAILED:
    ret.appendP(esp_mail_str_62);
    break;
  case IMAP_STATUS_NO_SUPPORTED_AUTH:
    ret.appendP(esp_mail_str_42);
    break;
  case IMAP_STATUS_CHECK_CAPABILITIES_FAILED:
    ret.appendP(esp_mail_str_63);
    break;
  case MAIL_CLIENT_ERROR_OUT_OF_MEMORY:
    ret.appendP(esp_mail_str_186);
    break;
  case IMAP_STATUS_NO_MAILBOX_FOLDER_OPENED:
    ret.appendP(esp_mail_str_153);
    break;

  default:
    break;
  }
  return ret.c_str();
}

bool IMAPSession::mSelectFolder(const char *folderName, bool readOnly)
{
  if (_tcpConnected)
  {
    if (!openFolder(folderName, readOnly))
      return false;
  }
  else
  {
    _currentFolder = folderName;
  }
  return true;
}

bool IMAPSession::mOpenFolder(const char *folderName, bool readOnly)
{
  if (!_tcpConnected)
    return false;
  if (readOnly)
    return openMailbox(folderName, esp_mail_imap_auth_mode::esp_mail_imap_mode_examine, true);
  else
    return openMailbox(folderName, esp_mail_imap_auth_mode::esp_mail_imap_mode_select, true);
}

bool IMAPSession::getFolders(FoldersCollection &folders)
{
  if (!_tcpConnected)
    return false;
  return getMailboxes(folders);
}

bool IMAPSession::mCloseFolder(const char *folderName)
{
  if (!_tcpConnected)
    return false;
  return closeMailbox();
}

bool IMAPSession::mListen(bool recon)
{
  //no folder opened or IDLE was not supported
  if (_currentFolder.length() == 0 || !_read_capability.idle)
  {
    _mbif._floderChangedState = false;
    _mbif._folderChanged = false;
    return false;
  }

  if (!MailClient.reconnect(this))
    return false;

  if (!_tcpConnected)
  {
    if (!_sesson_cfg || !_config)
      return false;

    //re-authenticate after session closed
    if (!MailClient.imapAuth(this))
    {
      MailClient.closeTCPSession(this);
      return false;
    }

    //re-open folder
    if (!selectFolder(_currentFolder.c_str()))
      return false;
  }

  if (_mbif._idleTimeMs == 0)
  {
    _mbif._polling_status.messageNum = 0;
    _mbif._polling_status.type = imap_polling_status_type_undefined;
    _mbif._polling_status.argument.clear();
    _mbif._recentCount = 0;
    _mbif._folderChanged = false;

    MB_String s;

    if (!recon)
    {

      if (_readCallback)
      {
        s.appendP(esp_mail_str_336);
        s += _currentFolder;
        s.appendP(esp_mail_str_337);
        MailClient.imapCB(this, "", false);
        MailClient.imapCB(this, s.c_str(), false);
      }

      if (_debug)
        MailClient.debugInfoP(esp_mail_str_335);
    }

    if (MailClient.imapSendP(this, esp_mail_str_331, true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_idle;
    if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
      return false;

