Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
  return true;
}

bool IMAPSession::mDeleteFolder(const char *folderName)
{
  if (_debug)
  {
    esp_mail_debug("");
    MailClient.debugInfoP(esp_mail_str_321);
  }

  MB_String cmd;
  cmd.appendP(esp_mail_str_323);
  cmd += folderName;

  if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_delete;
  if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
    return false;

  return true;
}

bool IMAPSession::deleteMessages(MessageList *toDelete, bool expunge)
{
  if (toDelete->_list.size() > 0)
  {

    if (!selectFolder(_currentFolder.c_str(), false))
      return false;

    if (_debug)
    {
      esp_mail_debug("");
      MailClient.debugInfoP(esp_mail_str_316);
    }

    MB_String cmd;

    cmd.appendP(esp_mail_str_249);
    for (size_t i = 0; i < toDelete->_list.size(); i++)
    {
      if (i > 0)
        cmd.appendP(esp_mail_str_263);
      cmd += toDelete->_list[i];
    }
    cmd.appendP(esp_mail_str_315);

    if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_store;
    if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
      return false;

    if (expunge)
    {
      if (MailClient.imapSendP(this, esp_mail_str_317, true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_expunge;
      if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
        return false;
    }
  }

  return true;
}

bool IMAPSession::mCopyMessages(MessageList *toCopy, const char *dest)
{
  if (toCopy->_list.size() > 0)
  {

    if (!selectFolder(_currentFolder.c_str(), false))
      return false;

    if (_debug)
    {
      MB_String s;
      s.appendP(esp_mail_str_318);
      s += dest;
      esp_mail_debug(s.c_str());
    }

    MB_String cmd;
    cmd.appendP(esp_mail_str_319);
    for (size_t i = 0; i < toCopy->_list.size(); i++)
    {
      if (i > 0)
        cmd.appendP(esp_mail_str_263);
      cmd += toCopy->_list[i];
    }
    cmd.appendP(esp_mail_str_131);
    cmd += dest;

    if (MailClient.imapSend(this, cmd.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    _imap_cmd = esp_mail_imap_command::esp_mail_imap_cmd_store;
    if (!MailClient.handleIMAPResponse(this, IMAP_STATUS_BAD_COMMAND, false))
      return false;
  }

  return true;
}

void IMAPSession::empty()
{
  _nextUID.clear();
  clearMessageData();
}

void IMAPSession::clearMessageData()
{
  for (size_t i = 0; i < _headers.size(); i++)
  {
    _headers[i].part_headers.clear();
    std::vector<struct esp_mail_message_part_info_t>().swap(_headers[i].part_headers);
  }
  std::vector<struct esp_mail_message_header_t>().swap(_headers);
  std::vector<uint32_t>().swap(_msgUID);
  _folders.clear();
  _mbif._flags.clear();
  _mbif._searchCount = 0;
  _flags_tmp.clear();
}

IMAP_Status::IMAP_Status()
{
}
IMAP_Status::~IMAP_Status()
{
  empty();
}

const char *IMAP_Status::info()
{
  return _info.c_str();
}

bool IMAP_Status::success()
{
  return _success;
}

void IMAP_Status::empty()
{
  _info.clear();
}

#endif

#if defined(ENABLE_SMTP)

void ESP_Mail_Client::mimeFromFile(const char *name, MB_String &mime)
{
  MB_String ext = name;
  size_t p = ext.find_last_of(".");
  if (p != MB_String::npos)
  {
    ext = ext.substr(p, ext.length() - p);
    if (ext.length() > 0)
      getMIME(ext.c_str(), mime);
  }
}

void ESP_Mail_Client::getMIME(const char *ext, MB_String &mime)
{
  mime.clear();
  for (int i = 0; i < esp_mail_file_extension_maxType; i++)
  {
    if (strcmp_P(ext, mimeinfo[i].endsWith) == 0)
    {
      mime.appendP(mimeinfo[i].mimeType);
      break;
    }
  }
}

MB_String ESP_Mail_Client::getEncodedToken(SMTPSession *smtp)
{
  MB_String raw;
  raw.appendP(esp_mail_str_285);
  raw += smtp->_sesson_cfg->login.email;
  raw.appendP(esp_mail_str_286);
  raw += smtp->_sesson_cfg->login.accessToken;
  raw.appendP(esp_mail_str_287);
  return encodeBase64Str((const unsigned char *)raw.c_str(), raw.length());
}

bool ESP_Mail_Client::smtpAuth(SMTPSession *smtp)
{

  if (!reconnect(smtp))
    return false;

  bool ssl = false;
  smtp->_secure = true;
  bool secureMode = true;

  MB_String s;

#if defined(ESP32)
  smtp->tcpClient.setDebugCallback(NULL);
#elif defined(ESP8266)
  smtp->tcpClient.rxBufDivider = 16; // minimum rx buffer for smtp status response
  smtp->tcpClient.txBufDivider = 8;  // medium tx buffer for faster attachment/inline data transfer
#endif

  if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_25)
  {
    smtp->_secure = false;
    secureMode = false;
  }
  else
  {
    if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_587)
      smtp->_sesson_cfg->secure.startTLS = true;

    secureMode = !smtp->_sesson_cfg->secure.startTLS;

    //to prevent to send the connection upgrade command when some server promotes
    //the starttls capability even the current connection was already secured.
    if (smtp->_sesson_cfg->server.port == esp_mail_smtp_port_465)
      ssl = true;
  }

#if defined(ESP32) || defined(ESP8266)
  setSecure(smtp->tcpClient, smtp->_sesson_cfg, smtp->_caCert);
#endif

  //Server connection attempt: no status code
  if (smtp->_sendCallback)
    smtpCBP(smtp, esp_mail_str_120);

  if (smtp->_debug)
  {
    s.appendP(esp_mail_str_314, true);
    s += ESP_MAIL_VERSION;
#if defined(ARDUINO_ARCH_SAMD) || defined(__AVR_ATmega4809__)
    s.appendP(esp_mail_str_329);
    s += WiFi.firmwareVersion();
    smtp->tcpClient.firmwareBuildNumber();
    if (smtp->tcpClient._fwBuild > 0)
    {
      s.appendP(esp_mail_str_330);
      s += smtp->tcpClient._fwBuild;
    }
#endif
    esp_mail_debug(s.c_str());

    debugInfoP(esp_mail_str_236);
    s.appendP(esp_mail_str_261, true);
    s.appendP(esp_mail_str_211);
    s += smtp->_sesson_cfg->server.host_name;
    esp_mail_debug(s.c_str());
    s.appendP(esp_mail_str_261, true);
    s.appendP(esp_mail_str_201);
    s += smtp->_sesson_cfg->server.port;
    esp_mail_debug(s.c_str());
  }
#if defined(ESP32)
  if (smtp->_debug)
    smtp->tcpClient.setDebugCallback(esp_mail_debug);
#endif

  smtp->tcpClient.begin(smtp->_sesson_cfg->server.host_name.c_str(), smtp->_sesson_cfg->server.port);

  ethDNSWorkAround(smtp->_sesson_cfg);

  if (!smtp->tcpClient.connect(secureMode, smtp->_sesson_cfg->certificate.verify))
    return handleSMTPError(smtp, SMTP_STATUS_SERVER_CONNECT_FAILED);

  //server connected
  smtp->_tcpConnected = true;

  if (smtp->_debug)
    debugInfoP(esp_mail_str_238);

  if (smtp->_sendCallback)
  {
    smtpCB(smtp, "");
    smtpCBP(smtp, esp_mail_str_121);
  }

#if defined(ESP32)
  smtp->tcpClient.stream()->setTimeout(TCP_CLIENT_DEFAULT_TCP_TIMEOUT_SEC);
#elif defined(ESP8266)
  smtp->tcpClient.stream()->setTimeout(TCP_CLIENT_DEFAULT_TCP_TIMEOUT_SEC * 1000);
#endif
  smtp->tcpClient.tcpTimeout = TCP_CLIENT_DEFAULT_TCP_TIMEOUT_SEC * 1000;

