Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
      if (smtpSend(smtp, encodeBase64Str((const unsigned char *)smtp->_sesson_cfg->login.password.c_str(), smtp->_sesson_cfg->login.password.length()).c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_login_psw;
      if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_235, SMTP_STATUS_PASSWORD_LOGIN_FAILED))
        return false;

      return true;
    }
  }

  return true;
}

bool ESP_Mail_Client::connected(SMTPSession *smtp)
{
  if (!smtp->tcpClient.stream())
    return false;
  return smtp->tcpClient.stream()->connected();
}

bool ESP_Mail_Client::setSendingResult(SMTPSession *smtp, SMTP_Message *msg, bool result)
{
  if (result)
    smtp->_sentSuccessCount++;
  else
    smtp->_sentFailedCount++;

  if (smtp->_sendCallback)
  {
    SMTP_Result status;
    status.completed = result;
#if defined(ARDUINO_ARCH_SAMD) || defined(__AVR_ATmega4809__)
    unsigned long ts = WiFi.getTime();
    status.timestamp = ts;
#else
    status.timestamp = time(nullptr);
#endif
    status.subject = msg->subject.c_str();
    status.recipients = msg->_rcp[0].email.c_str();

    smtp->sendingResult.add(&status);

    smtp->_cbData._sentSuccess = smtp->_sentSuccessCount;
    smtp->_cbData._sentFailed = smtp->_sentFailedCount;
  }

  return result;
}

bool ESP_Mail_Client::sendMail(SMTPSession *smtp, SMTP_Message *msg, bool closeSession)
{

  if (msg->html.content.length() > 0 || msg->html.blob.size > 0 || msg->html.file.name.length() > 0)
    msg->type |= esp_mail_msg_type_html;

  if (msg->text.content.length() > 0 || msg->text.blob.size > 0 || msg->text.file.name.length() > 0)
    msg->type |= esp_mail_msg_type_plain;

  for (size_t i = 0; i < msg->_rfc822.size(); i++)
  {
    if (msg->_rfc822[i].html.content.length() > 0)
      msg->_rfc822[i].type |= esp_mail_msg_type_html;

    if (msg->_rfc822[i].text.content.length() > 0)
      msg->_rfc822[i].type |= esp_mail_msg_type_plain;
  }

  return mSendMail(smtp, msg, closeSession);
}

size_t ESP_Mail_Client::numAtt(SMTPSession *smtp, esp_mail_attach_type type, SMTP_Message *msg)
{
  size_t count = 0;
  for (size_t i = 0; i < msg->_att.size(); i++)
  {
    if (msg->_att[i]._int.att_type == type)
      count++;
  }
  return count;
}

bool ESP_Mail_Client::checkEmail(SMTPSession *smtp, SMTP_Message *msg)
{
  bool validRecipient = false;

  if (!validEmail(msg->sender.email.c_str()))
  {
    errorStatusCB(smtp, SMTP_STATUS_NO_VALID_SENDER_EXISTED);
    return setSendingResult(smtp, msg, false);
  }

  for (uint8_t i = 0; i < msg->_rcp.size(); i++)
  {
    if (validEmail(msg->_rcp[i].email.c_str()))
      validRecipient = true;
  }

  if (!validRecipient)
  {
    errorStatusCB(smtp, SMTP_STATUS_NO_VALID_RECIPIENTS_EXISTED);
    return setSendingResult(smtp, msg, false);
  }

  return true;
}

bool ESP_Mail_Client::mSendMail(SMTPSession *smtp, SMTP_Message *msg, bool closeSession)
{

  smtp->_smtpStatus.statusCode = 0;
  smtp->_smtpStatus.respCode = 0;
  smtp->_smtpStatus.text.clear();
  bool rfc822MSG = false;

  if (!checkEmail(smtp, msg))
    return false;

  smtp->_chunkedEnable = false;
  smtp->_chunkCount = 0;

  //new session
  if (!smtp->_tcpConnected)
  {
    if (!smtpAuth(smtp))
    {
      closeTCPSession(smtp);
      return setSendingResult(smtp, msg, false);
    }
    smtp->_sentSuccessCount = 0;
    smtp->_sentFailedCount = 0;
    smtp->sendingResult.clear();
  }
  else
  {
    //reuse session
    if (smtp->_sendCallback)
    {
      smtpCB(smtp, "");
      if (smtp->_sentSuccessCount || smtp->_sentFailedCount)
        smtpCBP(smtp, esp_mail_str_267);
      else
        smtpCBP(smtp, esp_mail_str_208);
    }

    if (smtp->_debug)
    {
      if (smtp->_sentSuccessCount || smtp->_sentFailedCount)
        debugInfoP(esp_mail_str_268);
      else
        debugInfoP(esp_mail_str_207);
    }
  }

  if (smtp->_sendCallback)
  {
    smtpCB(smtp, "");
    smtpCBP(smtp, esp_mail_str_125);
  }

  if (smtp->_debug)
    debugInfoP(esp_mail_str_242);

  MB_String buf;
  MB_String buf2;
  checkBinaryData(smtp, msg);

  if (msg->priority >= esp_mail_smtp_priority_high && msg->priority <= esp_mail_smtp_priority_low)
  {
    buf2.appendP(esp_mail_str_17);
    buf2 += (int)msg->priority;
    buf2.appendP(esp_mail_str_34);

    if (msg->priority == esp_mail_smtp_priority_high)
    {
      buf2.appendP(esp_mail_str_18);
      buf2.appendP(esp_mail_str_21);
    }
    else if (msg->priority == esp_mail_smtp_priority_normal)
    {
      buf2.appendP(esp_mail_str_19);
      buf2.appendP(esp_mail_str_22);
    }
    else if (msg->priority == esp_mail_smtp_priority_low)
    {
      buf2.appendP(esp_mail_str_20);
      buf2.appendP(esp_mail_str_23);
    }
  }

  buf2.appendP(esp_mail_str_10);
  buf2.appendP(esp_mail_str_131);

  if (msg->sender.name.length() > 0)
    buf2 += msg->sender.name;

  buf2.appendP(esp_mail_str_14);
  buf2 += msg->sender.email;
  buf2.appendP(esp_mail_str_15);
  buf2.appendP(esp_mail_str_34);

  buf.appendP(esp_mail_str_8, true);
  buf.appendP(esp_mail_str_14);
  buf += msg->sender.email;
  buf.appendP(esp_mail_str_15);

  if (smtp->_send_capability.binaryMIME && smtp->_send_capability.chunking && msg->enable.chunking && (msg->text._int.binary || msg->html._int.binary))
    buf.appendP(esp_mail_str_104);

  if (smtpSend(smtp, buf.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_header_sender;
  if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_HEADER_SENDER_FAILED))
    return setSendingResult(smtp, msg, false);

  for (uint8_t i = 0; i < msg->_rcp.size(); i++)
  {
    if (i == 0)
    {
      buf2.appendP(esp_mail_str_11);
      buf2.appendP(esp_mail_str_131);
      if (msg->_rcp[i].name.length() > 0)
        buf2 += msg->_rcp[i].name;

      buf2.appendP(esp_mail_str_14);
      buf2 += msg->_rcp[i].email;
      buf2.appendP(esp_mail_str_15);
    }
    else
    {
      if (msg->_rcp[i].name.length() > 0)
      {
        buf2.appendP(esp_mail_str_263);
        buf2 += msg->_rcp[i].name;
        buf2.appendP(esp_mail_str_14);
      }
      else
        buf2.appendP(esp_mail_str_13);
      buf2 += msg->_rcp[i].email;
      buf2.appendP(esp_mail_str_15);
    }

