Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
      if (!bdat(smtp, msg, 0, true))
        return false;

      smtp->_smtp_cmd = esp_mail_smtp_cmd_chunk_termination;
      if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
        return false;
    }
    else
    {
      if (smtpSendP(smtp, esp_mail_str_37, false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return setSendingResult(smtp, msg, false);

      smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_body;
      if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
        return setSendingResult(smtp, msg, false);
    }

    setSendingResult(smtp, msg, true);

    if (closeSession)
      if (!smtp->closeSession())
        return false;
  }

  return true;
}

bool ESP_Mail_Client::sendRFC822Msg(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary, bool closeSession, bool rfc822MSG)
{
  if (msg->_rfc822.size() == 0)
    return true;
  MB_String buf;
  for (uint8_t i = 0; i < msg->_rfc822.size(); i++)
  {
    buf.clear();
    getRFC822PartHeader(smtp, buf, boundary);

    getRFC822MsgEnvelope(smtp, &msg->_rfc822[i], buf);

    if (!bdat(smtp, msg, buf.length(), false))
      return false;

    if (smtpSend(smtp, buf.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    if (!sendMSGData(smtp, &msg->_rfc822[i], closeSession, rfc822MSG))
      return false;
  }

  return true;
}

void ESP_Mail_Client::getRFC822MsgEnvelope(SMTPSession *smtp, SMTP_Message *msg, MB_String &buf)
{
  if (msg->date.length() > 0)
  {
    buf.appendP(esp_mail_str_99);
    buf += msg->date;
    buf.appendP(esp_mail_str_34);
  }
  else
  {

#if defined(ARDUINO_ARCH_SAMD) || defined(__AVR_ATmega4809__)
    unsigned long now = WiFi.getTime();
#else
    time_t now = time(nullptr);
#endif
    if (now > ESP_TIME_DEFAULT_TS)
    {
      buf.appendP(esp_mail_str_99);
      buf.appendP(esp_mail_str_131);
      buf += Time.getDateTimeString();
      buf.appendP(esp_mail_str_34);
    }
  }

  if (msg->from.email.length() > 0)
  {
    buf.appendP(esp_mail_str_10);
    buf.appendP(esp_mail_str_131);

    if (msg->from.name.length() > 0)
      buf += msg->from.name;

    buf.appendP(esp_mail_str_14);
    buf += msg->from.email;
    buf.appendP(esp_mail_str_15);
    buf.appendP(esp_mail_str_34);
  }

  if (msg->sender.email.length() > 0)
  {
    buf.appendP(esp_mail_str_150);
    buf.appendP(esp_mail_str_131);

    if (msg->sender.name.length() > 0)
      buf += msg->sender.name;

    buf.appendP(esp_mail_str_14);
    buf += msg->sender.email;
    buf.appendP(esp_mail_str_15);
    buf.appendP(esp_mail_str_34);
  }

  if (msg->response.reply_to.length() > 0)
  {
    buf.appendP(esp_mail_str_184);
    buf.appendP(esp_mail_str_131);
    buf.appendP(esp_mail_str_14);
    buf += msg->response.reply_to;
    buf.appendP(esp_mail_str_15);
    buf.appendP(esp_mail_str_34);
  }

  if (msg->response.return_path.length() > 0)
  {
    buf.appendP(esp_mail_str_46);
    buf.appendP(esp_mail_str_131);
    buf.appendP(esp_mail_str_14);
    buf += msg->response.return_path;
    buf.appendP(esp_mail_str_15);
    buf.appendP(esp_mail_str_34);
  }

  for (uint8_t i = 0; i < msg->_rcp.size(); i++)
  {
    if (i == 0)
    {
      buf.appendP(esp_mail_str_11);
      buf.appendP(esp_mail_str_131);
      if (msg->_rcp[i].name.length() > 0)
        buf += msg->_rcp[i].name;

      buf.appendP(esp_mail_str_14);
      buf += msg->_rcp[i].email;
      buf.appendP(esp_mail_str_15);
    }
    else
    {
      if (msg->_rcp[i].name.length() > 0)
      {
        buf.appendP(esp_mail_str_263);
        buf += msg->_rcp[i].name;
        buf.appendP(esp_mail_str_14);
      }
      else
        buf.appendP(esp_mail_str_13);
      buf += msg->_rcp[i].email;
      buf.appendP(esp_mail_str_15);
    }

    if (i == msg->_rcp.size() - 1)
      buf.appendP(esp_mail_str_34);
  }

  for (uint8_t i = 0; i < msg->_cc.size(); i++)
  {
    if (i == 0)
    {
      buf.appendP(esp_mail_str_12);
      buf.appendP(esp_mail_str_131);
      buf.appendP(esp_mail_str_14);
      buf += msg->_cc[i].email;
      buf.appendP(esp_mail_str_15);
    }
    else
    {
      buf.appendP(esp_mail_str_13);
      buf += msg->_cc[i].email;
      buf.appendP(esp_mail_str_15);
    }

    if (i == msg->_cc.size() - 1)
      buf.appendP(esp_mail_str_34);
  }

  for (uint8_t i = 0; i < msg->_bcc.size(); i++)
  {
    if (i == 0)
    {
      buf.appendP(esp_mail_str_149);
      buf.appendP(esp_mail_str_14);
      buf += msg->_bcc[i].email;
      buf.appendP(esp_mail_str_15);
    }
    else
    {
      buf.appendP(esp_mail_str_13);
      buf += msg->_bcc[i].email;
      buf.appendP(esp_mail_str_15);
    }

    if (i == msg->_bcc.size() - 1)
      buf.appendP(esp_mail_str_34);
  }

  if (msg->subject.length() > 0)
  {
    buf.appendP(esp_mail_str_24);
    buf.appendP(esp_mail_str_131);
    buf += msg->subject;
    buf.appendP(esp_mail_str_34);
  }

  if (msg->keywords.length() > 0)
  {
    buf.appendP(esp_mail_str_145);
    buf.appendP(esp_mail_str_131);
    buf += msg->keywords;
    buf.appendP(esp_mail_str_34);
  }

  if (msg->comments.length() > 0)
  {
    buf.appendP(esp_mail_str_134);
    buf.appendP(esp_mail_str_131);
    buf += msg->comments;
    buf.appendP(esp_mail_str_34);
  }

  if (msg->in_reply_to.length() > 0)
  {
    buf.appendP(esp_mail_str_109);
    buf.appendP(esp_mail_str_131);
    buf += msg->in_reply_to;
    buf.appendP(esp_mail_str_34);
  }

  if (msg->references.length() > 0)
  {
    buf.appendP(esp_mail_str_107);
    buf.appendP(esp_mail_str_131);
    buf += msg->references;
    buf.appendP(esp_mail_str_34);
  }

  if (msg->messageID.length() > 0)
  {
    buf.appendP(esp_mail_str_101);
    buf.appendP(esp_mail_str_131);
    buf.appendP(esp_mail_str_14);
    buf += msg->messageID;
    buf.appendP(esp_mail_str_15);
    buf.appendP(esp_mail_str_34);
  }
}

bool ESP_Mail_Client::bdat(SMTPSession *smtp, SMTP_Message *msg, int len, bool last)
{
  if (!smtp->_chunkedEnable || !msg->enable.chunking)
    return true;

