Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
  smtp->_chunkCount++;

  MB_String bdat;
  bdat.appendP(esp_mail_str_106);
  bdat += len;
  if (last)
    bdat.appendP(esp_mail_str_173);

  if (smtpSend(smtp, bdat.c_str(), true) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return setSendingResult(smtp, msg, false);

  if (!smtp->_send_capability.pipelining)
  {
    smtp->_smtp_cmd = esp_mail_smtp_command::esp_mail_smtp_cmd_send_body;
    if (!handleSMTPResponse(smtp, esp_mail_smtp_status_code_250, SMTP_STATUS_SEND_BODY_FAILED))
      return setSendingResult(smtp, msg, false);
    smtp->_chunkCount = 0;
  }
  return true;
}

void ESP_Mail_Client::checkBinaryData(SMTPSession *smtp, SMTP_Message *msg)
{
  if (msg->type & esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched || msg->type & esp_mail_msg_type_html)
  {
    if ((msg->type & esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched) > 0)
    {
      if (msg->text.transfer_encoding.length() > 0)
      {
        if (strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_binary) == 0)
        {
          msg->text._int.binary = true;
        }
      }
    }

    if ((msg->type & esp_mail_msg_type_html) > 0)
    {
      if (msg->html.transfer_encoding.length() > 0)
      {
        if (strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_binary) == 0)
        {
          msg->html._int.binary = true;
        }
      }
    }
  }

  for (size_t i = 0; i < msg->_att.size(); i++)
  {
    if (strcmpP(msg->_att[i].descr.transfer_encoding.c_str(), 0, esp_mail_str_166))
    {
      msg->_att[i]._int.binary = true;
    }
  }
}

bool ESP_Mail_Client::sendBlob(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att)
{
  if (strcmp(att->descr.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0 && strcmp(att->descr.transfer_encoding.c_str(), att->descr.content_encoding.c_str()) != 0)
  {
    if (!sendBase64(smtp, msg, (const unsigned char *)att->blob.data, att->blob.size, att->_int.flash_blob, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
      return false;
    return true;
  }
  else
  {
    if (att->blob.size > 0)
    {
      if (strcmp(att->descr.content_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        if (!sendBase64Raw(smtp, msg, att->blob.data, att->blob.size, att->_int.flash_blob, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
          return false;
        return true;
      }
      else
      {

        size_t chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
        size_t writeLen = 0;
        uint8_t *buf = (uint8_t *)newP(chunkSize);
        int pg = 0, _pg = 0;
        while (writeLen < att->blob.size)
        {
          if (writeLen > att->blob.size - chunkSize)
            chunkSize = att->blob.size - writeLen;

          if (!bdat(smtp, msg, chunkSize, false))
            break;
          memcpy_P(buf, att->blob.data, chunkSize);
          if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            break;

          if (smtp->_sendCallback)
          {
            pg = (float)(100.0f * writeLen / att->blob.size);
            if (pg != _pg)
              uploadReport(att->descr.filename.c_str(), pg);
            _pg = pg;
          }
          writeLen += chunkSize;
        }
        delP(&buf);
        if (smtp->_sendCallback && _pg < 100)
          uploadReport(att->descr.filename.c_str(), 100);

        return writeLen >= att->blob.size;
      }
    }
  }
  return false;
}

bool ESP_Mail_Client::sendFile(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, File &file)
{
  if (strcmp(att->descr.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0 && strcmp(att->descr.transfer_encoding.c_str(), att->descr.content_encoding.c_str()) != 0)
  {
    if (!sendBase64Stream(smtp, msg, file, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
      return false;
    return true;
  }
  else
  {
    if (file.size() > 0)
    {
      if (strcmp(att->descr.content_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
      {
        if (!sendBase64StreamRaw(smtp, msg, file, att->descr.filename.c_str(), smtp->_sendCallback != NULL))
          return false;
        return true;
      }
      else
      {
        size_t chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
        size_t writeLen = 0;
        if (file.size() < chunkSize)
          chunkSize = file.size();
        uint8_t *buf = (uint8_t *)newP(chunkSize);
        int pg = 0, _pg = 0;
        while (writeLen < file.size() && file.available())
        {
          if (writeLen > file.size() - chunkSize)
            chunkSize = file.size() - writeLen;
          size_t readLen = file.read(buf, chunkSize);
          if (readLen != chunkSize)
          {
            errorStatusCB(smtp, MAIL_CLIENT_ERROR_FILE_IO_ERROR);
            break;
          }

          if (!bdat(smtp, msg, chunkSize, false))
            break;

          if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
            break;

          if (smtp->_sendCallback)
          {
            pg = (float)(100.0f * writeLen / file.size());
            if (pg != _pg)
              uploadReport(att->descr.filename.c_str(), pg);
            _pg = pg;
          }
          writeLen += chunkSize;
        }
        delP(&buf);
        if (smtp->_sendCallback && _pg < 100)
          uploadReport(att->descr.filename.c_str(), 100);
        return writeLen == file.size();
      }
    }
    return false;
  }
  return false;
}

bool ESP_Mail_Client::sendParallelAttachments(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary)
{
  if (msg->_parallel.size() == 0)
    return true;

  MB_String buf;
  MB_String parallel = getBoundary(15);
  buf.appendP(esp_mail_str_33);
  buf += boundary;
  buf.appendP(esp_mail_str_34);

  buf.appendP(esp_mail_str_28);
  buf += parallel;
  buf.appendP(esp_mail_str_35);

  if (!bdat(smtp, msg, buf.length(), false))
    return false;

