Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
        header.appendP(esp_mail_str_301);
        header += msg->html._int.cid;
        header.appendP(esp_mail_str_15);
        header.appendP(esp_mail_str_34);
      }
    }
  }

  header.appendP(esp_mail_str_34);

  if ((msg->text.blob.size > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (msg->html.blob.size > 0 && type == esp_mail_msg_type_html))
  {
    if (!bdat(smtp, msg, header.length(), false))
      return false;

    if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    header.clear();

    if (!sendBlobBody(smtp, msg, type))
      return false;
  }
  else if ((msg->text.file.name.length() > 0 && (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)) || (msg->html.file.name.length() > 0 && type == esp_mail_msg_type_html))
  {
    if (!bdat(smtp, msg, header.length(), false))
      return false;

    if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    header.clear();

    if (!sendFileBody(smtp, msg, type))
      return false;
  }
  else
    encodingText(smtp, msg, type, header);

  header.appendP(esp_mail_str_34);

  if (strlen(boundary) > 0)
    header.appendP(esp_mail_str_34);

  if (!bdat(smtp, msg, header.length(), false))
    return false;

  if (smtpSend(smtp, header.c_str()) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
    return false;

  return true;
}

bool ESP_Mail_Client::sendBlobBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{

  if (msg->text.blob.size == 0 && msg->html.blob.size == 0)
    return true;

  bool ret = true;
  int bufLen = 512;
  size_t pos = 0;
  int pg = 0, _pg = 0;

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {
    if (msg->text.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
        return sendBase64(smtp, msg, (const unsigned char *)msg->text.blob.data, msg->text.blob.size, true, pgm2Str(esp_mail_str_325), smtp->_sendCallback != NULL);
    }

    int len = msg->text.blob.size;
    int available = len;
    uint8_t *buf = (uint8_t *)newP(bufLen + 1);
    while (available)
    {
      if (available > bufLen)
        available = bufLen;

      memcpy_P(buf, msg->text.blob.data + pos, available);

      if (!bdat(smtp, msg, available, false))
        break;
      if (smtpSend(smtp, buf, available) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        break;
      pos += available;
      len -= available;
      available = len;
      if (smtp->_sendCallback)
      {
        pg = (float)(100.0f * pos / msg->text.blob.size);
        if (pg != _pg)
          uploadReport(pgm2Str(esp_mail_str_325), pg);
        _pg = pg;
      }
    }
    delP(&buf);
  }
  else if (type == esp_mail_message_type::esp_mail_msg_type_html)
  {
    if (msg->html.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
        return sendBase64(smtp, msg, (const unsigned char *)msg->html.blob.data, msg->html.blob.size, true, pgm2Str(esp_mail_str_325), smtp->_sendCallback != NULL);
    }
    int len = msg->html.blob.size;
    int available = len;
    uint8_t *buf = (uint8_t *)newP(bufLen + 1);
    while (available)
    {

      if (available > bufLen)
        available = bufLen;

      memcpy_P(buf, msg->html.blob.data + pos, available);

      if (!bdat(smtp, msg, available, false))
      {
        ret = false;
        break;
      }

      if (smtpSend(smtp, buf, available) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      {
        ret = false;
        break;
      }

      pos += available;
      len -= available;
      available = len;
      if (smtp->_sendCallback)
      {
        pg = (float)(100.0f * pos / msg->html.blob.size);
        if (pg != _pg)
          uploadReport(pgm2Str(esp_mail_str_325), pg);
        _pg = pg;
      }
    }
    delP(&buf);
  }
  return ret;
}

bool ESP_Mail_Client::sendFileBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type)
{

  if (msg->text.file.name.length() == 0 && msg->html.file.name.length() == 0)
    return true;

  bool ret = true;
  size_t chunkSize = ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE;
  size_t writeLen = 0;
  int pg = 0, _pg = 0;

  if (type == esp_mail_msg_type_plain || type == esp_mail_msg_type_enriched)
  {

    if (!openFileRead2(smtp, msg, file, msg->text.file.name.c_str(), msg->text.file.type))
      return false;

    if (msg->text.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->text.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
        return sendBase64Stream(smtp, msg, file, pgm2Str(esp_mail_str_326), smtp->_sendCallback != NULL);
    }

    if (file.size() > 0)
    {

      if (file.size() < chunkSize)
        chunkSize = file.size();
      uint8_t *buf = (uint8_t *)newP(chunkSize);
      while (writeLen < file.size() && file.available())
      {
        if (writeLen > file.size() - chunkSize)
          chunkSize = file.size() - writeLen;
        size_t readLen = file.read(buf, chunkSize);

        if (readLen != chunkSize)
        {
          errorStatusCB(smtp, MAIL_CLIENT_ERROR_FILE_IO_ERROR);
          break;
        }

        if (!bdat(smtp, msg, chunkSize, false))
        {
          ret = false;
          break;
        }

        if (smtpSend(smtp, buf, chunkSize) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        {
          ret = false;
          break;
        }

        if (smtp->_sendCallback)
        {
          pg = (float)(100.0f * writeLen / file.size());
          if (pg != _pg)
            uploadReport(pgm2Str(esp_mail_str_326), pg);
          _pg = pg;
        }
        writeLen += chunkSize;
      }
      delP(&buf);
      if (smtp->_sendCallback && _pg < 100)
        uploadReport(pgm2Str(esp_mail_str_326), 100);

      return ret && writeLen == file.size();
    }
  }
  else if (type == esp_mail_message_type::esp_mail_msg_type_html)
  {

    if (!openFileRead2(smtp, msg, file, msg->html.file.name.c_str(), msg->html.file.type))
      return false;

    if (msg->html.transfer_encoding.length() > 0)
    {
      if (strcmp(msg->html.transfer_encoding.c_str(), Content_Transfer_Encoding::enc_base64) == 0)
        return sendBase64Stream(smtp, msg, file, pgm2Str(esp_mail_str_326), smtp->_sendCallback != NULL);
    }

    if (file.size() > 0)
    {

