Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
bool ESP_Mail_Client::sendMSG(SMTPSession *smtp, SMTP_Message *msg, const MB_String &boundary)
{
  MB_String alt = getBoundary(15);
  MB_String s;

  if (numAtt(smtp, esp_mail_att_type_inline, msg) > 0)
  {
    s.appendP(esp_mail_str_297);
    s += alt;
    s.appendP(esp_mail_str_35);

    if (!bdat(smtp, msg, s.length(), false))
      return false;

    if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;

    if (msg->type == esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched || msg->type == esp_mail_msg_type_html)
    {
      if (!sendInline(smtp, msg, alt, msg->type))
        return false;
    }
    else if (msg->type == (esp_mail_msg_type_html | esp_mail_msg_type_enriched | esp_mail_msg_type_plain))
    {
      if (!sendPartText(smtp, msg, esp_mail_msg_type_plain, alt.c_str()))
        return false;
      if (!sendInline(smtp, msg, alt, esp_mail_msg_type_html))
        return false;
    }

    s.appendP(esp_mail_str_33, true);
    s += alt;
    s.appendP(esp_mail_str_33);
    s.appendP(esp_mail_str_34);

    if (!bdat(smtp, msg, s.length(), false))
      return false;

    if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      return false;
  }
  else
  {
    if (msg->type == esp_mail_msg_type_plain || msg->type == esp_mail_msg_type_enriched || msg->type == esp_mail_msg_type_html)
    {
      if (!sendPartText(smtp, msg, msg->type, ""))
        return false;
    }
    else if (msg->type == (esp_mail_msg_type_html | esp_mail_msg_type_enriched | esp_mail_msg_type_plain))
    {
      s.appendP(esp_mail_str_33, true);
      s += boundary;
      s.appendP(esp_mail_str_34);
      s.appendP(esp_mail_str_297);
      s += alt;
      s.appendP(esp_mail_str_35);

      if (!bdat(smtp, msg, s.length(), false))
        return false;

      if (smtpSend(smtp, s.c_str(), false) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        return false;

      if (!sendPartText(smtp, msg, esp_mail_msg_type_plain, alt.c_str()))
        return false;

      if (!sendPartText(smtp, msg, esp_mail_msg_type_html, alt.c_str()))
        return false;
    }
  }
  return true;
}

void ESP_Mail_Client::getInlineHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *inlineAttach, size_t size)
{
  header.appendP(esp_mail_str_33);
  header += boundary;
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_25);
  header.appendP(esp_mail_str_131);

  if (inlineAttach->descr.mime.length() == 0)
  {
    MB_String mime;
    mimeFromFile(inlineAttach->descr.filename.c_str(), mime);
    if (mime.length() > 0)
      header += mime;
    else
      header.appendP(esp_mail_str_32);
  }
  else
    header += inlineAttach->descr.mime;

  header.appendP(esp_mail_str_26);

  MB_String filename = inlineAttach->descr.filename;

  size_t found = filename.find_last_of("/\\");

  if (found != MB_String::npos)
    filename = filename.substr(found + 1);

  header += filename;
  header.appendP(esp_mail_str_36);

  header.appendP(esp_mail_str_299);
  header += filename;
  header.appendP(esp_mail_str_327);
  header += size;
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_300);
  header += filename;
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_301);
  if (inlineAttach->descr.content_id.length() > 0)
    header += inlineAttach->descr.content_id;
  else
    header += inlineAttach->_int.cid;

  header.appendP(esp_mail_str_15);

  header.appendP(esp_mail_str_34);

  if (inlineAttach->descr.transfer_encoding.length() > 0)
  {
    header.appendP(esp_mail_str_272);
    header += inlineAttach->descr.transfer_encoding;
    header.appendP(esp_mail_str_34);
  }
  header.appendP(esp_mail_str_34);

  filename.clear();
}

void ESP_Mail_Client::getAttachHeader(MB_String &header, const MB_String &boundary, SMTP_Attachment *attach, size_t size)
{
  header.appendP(esp_mail_str_33);
  header += boundary;
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_25);
  header.appendP(esp_mail_str_131);

  if (attach->descr.mime.length() == 0)
  {
    MB_String mime;
    mimeFromFile(attach->descr.filename.c_str(), mime);
    if (mime.length() > 0)
      header += mime;
    else
      header.appendP(esp_mail_str_32);
  }
  else
    header += attach->descr.mime;

  header.appendP(esp_mail_str_26);

  MB_String filename = attach->descr.filename;

  size_t found = filename.find_last_of("/\\");
  if (found != MB_String::npos)
    filename = filename.substr(found + 1);

  header += filename;
  header.appendP(esp_mail_str_36);

  if (!attach->_int.parallel)
  {
    header.appendP(esp_mail_str_30);
    header += filename;
    header.appendP(esp_mail_str_327);
    header += size;
    header.appendP(esp_mail_str_34);
  }

  if (attach->descr.transfer_encoding.length() > 0)
  {
    header.appendP(esp_mail_str_272);
    header += attach->descr.transfer_encoding;
    header.appendP(esp_mail_str_34);
  }

  header.appendP(esp_mail_str_34);
}

void ESP_Mail_Client::getRFC822PartHeader(SMTPSession *smtp, MB_String &header, const MB_String &boundary)
{
  header.appendP(esp_mail_str_33);
  header += boundary;
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_25);
  header.appendP(esp_mail_str_131);

  header.appendP(esp_mail_str_123);
  header.appendP(esp_mail_str_34);

  header.appendP(esp_mail_str_98);

  header.appendP(esp_mail_str_34);
}

void ESP_Mail_Client::smtpCBP(SMTPSession *smtp, PGM_P info, bool success)
{
  MB_String s;
  s.appendP(info);
  smtp->_cbData._info = s;
  smtp->_cbData._success = success;
  smtp->_sendCallback(smtp->_cbData);
}

void ESP_Mail_Client::smtpCB(SMTPSession *smtp, const char *info, bool success)
{
  smtp->_cbData._info = info;
  smtp->_cbData._success = success;
  smtp->_sendCallback(smtp->_cbData);
}

bool ESP_Mail_Client::sendBase64Raw(SMTPSession *smtp, SMTP_Message *msg, const uint8_t *data, size_t len, bool flashMem, const char *filename, bool report)
{
  bool ret = false;

  size_t chunkSize = (BASE64_CHUNKED_LEN * UPLOAD_CHUNKS_NUM) + (2 * UPLOAD_CHUNKS_NUM);
  size_t bufIndex = 0;
  size_t dataIndex = 0;

  if (len < chunkSize)
    chunkSize = len;

  uint8_t *buf = (uint8_t *)newP(chunkSize);
  memset(buf, 0, chunkSize);

  int pg = 0, _pg = 0;

  if (report)
    uploadReport(filename, dataIndex);

  while (dataIndex < len - 1)
  {

    size_t size = 4;
    if (dataIndex + size > len - 1)
      size = len - dataIndex;

    if (flashMem)
      memcpy_P(buf + bufIndex, data + dataIndex, size);
    else
      memcpy(buf + bufIndex, data + dataIndex, size);

