Lamlmao/microprocessing/.pio/libdeps/esp32doit-devkit-v1/ESP Mail Client/src/ESP_Mail_Client.cpp
  return status;
}

void ESP_Mail_Client::uploadReport(const char *filename, int progress)
{
  if (progress % ESP_MAIL_PROGRESS_REPORT_STEP == 0)
  {
    MB_String s;
    s.appendP(esp_mail_str_160);
    s += filename;
    s.appendP(esp_mail_str_91);
    s += progress;
    s.appendP(esp_mail_str_92);
    s.appendP(esp_mail_str_34);
    esp_mail_debug_line(s.c_str(), false);
  }
}

MB_String ESP_Mail_Client::getBoundary(size_t len)
{
  MB_String tmp;
  tmp.appendP(boundary_table);
  char *buf = (char *)newP(len);
  if (len)
  {
    --len;
    buf[0] = tmp[0];
    buf[1] = tmp[1];
    for (size_t n = 2; n < len; n++)
    {
      int key = rand() % (int)(tmp.length() - 1);
      buf[n] = tmp[key];
    }
    buf[len] = '\0';
  }
  MB_String s = buf;
  delP(&buf);
  return s;
}

bool ESP_Mail_Client::sendBase64(SMTPSession *smtp, SMTP_Message *msg, const unsigned char *data, size_t len, bool flashMem, const char *filename, bool report)
{
  bool ret = false;
  const unsigned char *end, *in;

  end = data + len;
  in = data;

  size_t chunkSize = (BASE64_CHUNKED_LEN * UPLOAD_CHUNKS_NUM) + (2 * UPLOAD_CHUNKS_NUM);
  size_t byteAdded = 0;
  size_t byteSent = 0;

  int dByte = 0;
  unsigned char *buf = (unsigned char *)newP(chunkSize);
  memset(buf, 0, chunkSize);

  unsigned char *tmp = (unsigned char *)newP(3);
  int bcnt = 0;
  int pg = 0, _pg = 0;

  if (report)
    uploadReport(filename, bcnt);

  while (end - in >= 3)
  {

    memset(tmp, 0, 3);
    if (flashMem)
      memcpy_P(tmp, in, 3);
    else
      memcpy(tmp, in, 3);
    bcnt += 3;

    buf[byteAdded++] = b64_index_table[tmp[0] >> 2];
    buf[byteAdded++] = b64_index_table[((tmp[0] & 0x03) << 4) | (tmp[1] >> 4)];
    buf[byteAdded++] = b64_index_table[((tmp[1] & 0x0f) << 2) | (tmp[2] >> 6)];
    buf[byteAdded++] = b64_index_table[tmp[2] & 0x3f];
    dByte += 4;
    if (dByte == BASE64_CHUNKED_LEN)
    {
      if (byteAdded + 1 < chunkSize)
      {
        buf[byteAdded++] = 0x0d;
        buf[byteAdded++] = 0x0a;
      }
      dByte = 0;
    }
    if (byteAdded >= chunkSize - 4)
    {
      byteSent += byteAdded;

      if (!bdat(smtp, msg, byteAdded, false))
        goto ex;

      if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
        goto ex;
      memset(buf, 0, chunkSize);
      byteAdded = 0;
    }
    in += 3;

    if (report)
    {
      pg = (float)(100.0f * bcnt / len);
      if (pg != _pg)
        uploadReport(filename, pg);
      _pg = pg;
    }
  }

  if (byteAdded > 0)
  {
    if (!bdat(smtp, msg, byteAdded, false))
      goto ex;

    if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      goto ex;
  }

  if (end - in)
  {
    memset(buf, 0, chunkSize);
    byteAdded = 0;
    memset(tmp, 0, 3);
    if (flashMem)
    {
      if (end - in == 1)
        memcpy_P(tmp, in, 1);
      else
        memcpy_P(tmp, in, 2);
    }
    else
    {
      if (end - in == 1)
        memcpy(tmp, in, 1);
      else
        memcpy(tmp, in, 2);
    }

    buf[byteAdded++] = b64_index_table[tmp[0] >> 2];
    if (end - in == 1)
    {
      buf[byteAdded++] = b64_index_table[(tmp[0] & 0x03) << 4];
      buf[byteAdded++] = '=';
    }
    else
    {
      buf[byteAdded++] = b64_index_table[((tmp[0] & 0x03) << 4) | (tmp[1] >> 4)];
      buf[byteAdded++] = b64_index_table[(tmp[1] & 0x0f) << 2];
    }
    buf[byteAdded++] = '=';

    if (!bdat(smtp, msg, byteAdded, false))
      goto ex;

    if (smtpSend(smtp, buf, byteAdded) == ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED)
      goto ex;
    memset(buf, 0, chunkSize);
  }

  if (report && _pg < 100)
    uploadReport(filename, 100);

  ret = true;
ex:
  if (report)
    esp_mail_debug("");
  delP(&tmp);
  delP(&buf);
  return ret;
}

SMTPSession::SMTPSession()
{
}

SMTPSession::~SMTPSession()
{
  closeSession();
#if defined(ESP32) || defined(ESP8266)
  _caCert.reset();
  _caCert = nullptr;
#endif
}

bool SMTPSession::connect(ESP_Mail_Session *config)
{
  if (_tcpConnected)
    MailClient.closeTCPSession(this);

  if (config)
  {
    if (config->time.ntp_server.length() > 0)
    {

#if defined(ESP_MAIL_DEFAULT_DEBUG_PORT)
      ESP_MAIL_DEFAULT_DEBUG_PORT.println(F("Acquiring time from NTP server...\n"));
#endif
      MailClient.Time.setClock(config->time.gmt_offset, config->time.day_light_offset, config->time.ntp_server.c_str());
      unsigned long waitMs = millis();
      while (!MailClient.Time.clockReady() && millis() - waitMs < 5000)
      {
        delay(0);
      }
      MailClient._clockReady = MailClient.Time.clockReady();
    }
  }

  _sesson_cfg = config;
#if defined(ESP32) || defined(ESP8266)
  _caCert = nullptr;
  if (strlen(_sesson_cfg->certificate.cert_data) > 0)
    _caCert = std::shared_ptr<const char>(_sesson_cfg->certificate.cert_data);
#endif

  if (strlen(_sesson_cfg->certificate.cert_file) > 0)
  {
    if (_sesson_cfg->certificate.cert_file_storage_type == esp_mail_file_storage_type::esp_mail_file_storage_type_sd && !MailClient._sdOk)
      MailClient._sdOk = MailClient.sdTest();
    if (_sesson_cfg->certificate.cert_file_storage_type == esp_mail_file_storage_type::esp_mail_file_storage_type_flash && !MailClient._flashOk)
    {
#if defined(ESP_MAIL_FLASH_FS)
#if defined(ESP32)
      MailClient._flashOk = ESP_MAIL_FLASH_FS.begin(FORMAT_FLASH);
#elif defined(ESP8266)
      MailClient._flashOk = ESP_MAIL_FLASH_FS.begin();
#endif
#endif
    }
  }
  return MailClient.smtpAuth(this);
}

void SMTPSession::debug(int level)
{
  if (level > esp_mail_debug_level_0)
  {
    if (level > esp_mail_debug_level_3)
      level = esp_mail_debug_level_1;
    _debugLevel = level;
    _debug = true;
  }
  else
  {
    _debugLevel = esp_mail_debug_level_0;
    _debug = false;
  }
}

String SMTPSession::errorReason()
{
  MB_String ret;

  switch (_smtpStatus.statusCode)
  {
  case SMTP_STATUS_SERVER_CONNECT_FAILED:
    ret.appendP(esp_mail_str_38);
    break;
  case SMTP_STATUS_SMTP_GREETING_GET_RESPONSE_FAILED:
    ret.appendP(esp_mail_str_39);
    break;
  case SMTP_STATUS_SMTP_GREETING_SEND_ACK_FAILED:
    ret.appendP(esp_mail_str_39);
    break;
  case SMTP_STATUS_AUTHEN_NOT_SUPPORT:
    ret.appendP(esp_mail_str_42);
    break;
  case SMTP_STATUS_AUTHEN_FAILED:
    ret.appendP(esp_mail_str_43);
    break;
  case SMTP_STATUS_USER_LOGIN_FAILED:
    ret.appendP(esp_mail_str_43);
    break;
  case SMTP_STATUS_PASSWORD_LOGIN_FAILED:
    ret.appendP(esp_mail_str_47);
    break;
  case SMTP_STATUS_SEND_HEADER_SENDER_FAILED:
    ret.appendP(esp_mail_str_48);
    break;
  case SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED:
    ret.appendP(esp_mail_str_222);
    break;
  case SMTP_STATUS_SEND_BODY_FAILED:
    ret.appendP(esp_mail_str_49);
    break;
  case MAIL_CLIENT_ERROR_CONNECTION_CLOSED:
    ret.appendP(esp_mail_str_221);
    break;
  case MAIL_CLIENT_ERROR_READ_TIMEOUT:
    ret.appendP(esp_mail_str_258);
    break;
  case MAIL_CLIENT_ERROR_FILE_IO_ERROR:
    ret.appendP(esp_mail_str_282);
    break;
  case SMTP_STATUS_SERVER_OAUTH2_LOGIN_DISABLED:
    ret.appendP(esp_mail_str_293);
    break;
  case MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED:
    ret.appendP(esp_mail_str_305);
    break;
  case MAIL_CLIENT_ERROR_SSL_TLS_STRUCTURE_SETUP:
    ret.appendP(esp_mail_str_132);
    break;
  case SMTP_STATUS_NO_VALID_RECIPIENTS_EXISTED:
    ret.appendP(esp_mail_str_206);
    break;
  case SMTP_STATUS_NO_VALID_SENDER_EXISTED:
    ret.appendP(esp_mail_str_205);
    break;
  case MAIL_CLIENT_ERROR_OUT_OF_MEMORY:
    ret.appendP(esp_mail_str_186);
    break;
  case SMTP_STATUS_NO_SUPPORTED_AUTH:
    ret.appendP(esp_mail_str_42);
    break;
  default:
    break;
  }

  if (_smtpStatus.text.length() > 0 && ret.length() == 0)
  {
    ret.appendP(esp_mail_str_312, true);
    ret += _smtpStatus.respCode;
    ret.appendP(esp_mail_str_313);
    ret += _smtpStatus.text;
    return ret.c_str();
  }
  return ret.c_str();
}

